console.log('-----total=70-----');

console.group('Вёрстка +10');

console.log('-на странице есть несколько фото и строка поиска +5\n\n');
console.log(
  '-в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс +5\n\n'
);

console.groupEnd();

console.group(
  'При загрузке приложения на странице отображаются полученные от API изображения +10'
);

console.groupEnd();

console.group(
  'Если в поле поиска ввести слово и отправить поисковый запрос, на странице отобразятся изображения соответствующей тематики, если такие данные предоставляет API +10'
);
console.groupEnd();

console.group('Поиск +30');

console.log('-при открытии приложения курсор находится в поле ввода +5\n\n');
console.log('-есть placeholder +5\n\n');
console.log(
  '-автозаполнение поля ввода отключено (нет выпадающего списка с предыдущими запросами) +5\n\n'
);
console.log('-поисковый запрос можно отправить нажатием клавиши Enter +5\n\n');
console.log(
  '-после отправки поискового запроса и отображения результатов поиска, поисковый запрос продолжает отображаться в поле ввода +5\n\n'
);
console.log(
  '-в поле ввода есть крестик при клике по которому поисковый запрос из поля ввода удаляется и отображается placeholder +5\n\n'
);

console.groupEnd();

console.group(
  'Очень высокое качество оформления приложения и/или дополнительный не предусмотренный в задании функционал, улучшающий качество приложения +10'
);

console.log(
  'Высокое качество оформления приложения предполагает собственное оригинальное оформление равное или отличающееся в лучшую сторону по сравнению с демо\n\n'
);

console.log(
  'Дополнительный не предусмотренный в задании функционал: перекдючение темы день/ночь, слайдер\n\n'
);

console.groupEnd();

console.log('-----total=70-----');
