console.log('-----total=70-----');

console.group('Вёрстка +10');

console.log('-реализован интерфейс игры +5\n\n');
console.log(
  '-в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс +5\n\n'
);

console.groupEnd();

console.group(
  'Логика игры. Ходы, перемещения фигур, другие действия игрока подчиняются определённым свойственным игре правилам +10'
);

console.groupEnd();

console.group('Реализовано завершение игры при достижении игровой цели +10');
console.groupEnd();

console.group(
  'По окончанию игры выводится её результат, например, количество ходов, время игры, набранные баллы, выигрыш или поражение и т.д +10'
);
console.groupEnd();

console.group(
  'Есть таблица результатов, в которой сохраняются результаты 10 игр с наибольшим счетом (лучшим временем и т.п.) или просто 10 последних игр (хранится в local storage) +10'
);
console.groupEnd();

console.group(
  'Анимации или звуки, или настройки игры. Баллы начисляются за любой из перечисленных пунктов +10'
);
console.groupEnd();

console.group(
  'Очень высокое качество оформления приложения и/или дополнительный не предусмотренный в задании функционал, улучшающий качество приложения +10'
);

console.log(
  '-высокое качество оформления приложения предполагает собственное оригинальное оформление равное или отличающееся в лучшую сторону по сравнению с демо'
);

console.groupEnd();

console.log('-----total=70-----');
