console.log('-----total=70-----');

console.group('Вёрстка +10');

console.log(
  '-вёрстка аудиоплеера: есть кнопка Play/Pause, кнопки "Вперёд" и "Назад" для пролистывания аудиотреков, прогресс-бар, отображается название и автор трека +5\n\n'
);
console.log(
  '-в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс +5\n\n'
);

console.groupEnd();

console.group('Кнопка Play/Pause +10');

console.log(
  '-есть кнопка Play/Pause, при клике по которой можно запустить или остановить проигрывание аудиотрека +5\n\n'
);
console.log(
  '-внешний вид и функционал кнопки Play/Pause изменяется в зависимости от того, проигрывается ли в данный момент аудиотрек +5\n\n'
);

console.groupEnd();
console.group(
  '-при кликах по кнопкам "Вперёд" и "Назад" переключается проигрываемый аудиотрек. Аудиотреки пролистываются по кругу - после последнего идёт первый +10'
);
console.groupEnd();

console.group(
  '-при смене аудиотрека меняется изображение - обложка аудиотрека +10'
);
console.groupEnd();

console.group(
  '-прогресс-бар отображает прогресс проигрывания текущего аудиотрека. При перемещении ползунка вручную меняется текущее время проигрывания аудиотрека +10'
);
console.groupEnd();
console.group(
  '-отображается продолжительность аудиотрека и его текущее время проигрывания +10'
);
console.groupEnd();
console.group(
  '-очень высокое качество оформления приложения и/или дополнительный не предусмотренный в задании функционал, улучшающий качество приложения +10'
);

console.log(
  '-высокое качество оформления приложения предполагает собственное оригинальное оформление равное или отличающееся в лучшую сторону по сравнению с демо\n\n'
);

console.groupEnd();

console.log('-----total=70-----');
